app/controllers/answers_controller.rb

  def answerq
    @i=0
    @survey_id=params[:id]
    @question_surveys=QuestionSurvey.find(:all, :conditions => {:survey_id => params[:id] })
---
SELECT * FROM "question_surveys" WHERE ("question_surveys"."survey_id" = '1')

  def saveresponse
    @answer=Answer.create(:user_id => current_user.id, :survey_id => params[:survey_id])
    for j in params[:question_id].values
      if (params[:questiontype_id][j] != '3')
        @q1=AnswerQuestion.create(:answer_id => @answer.id, :question_id => j, :answer_text => params[:answer_text][j])
---
INSERT INTO "answers" ("created_at", "updated_at", "survey_id", "user_id") VALUES('2010-08-05 10:45:52.336181', '2010-08-05 10:45:52.336181', 1, 1) RETURNING "id"
INSERT INTO "answer_questions" ("question_id", "created_at", "updated_at", "answer_text", "answer_id") VALUES(1, '2010-08-05 10:45:52.345916', '2010-08-05 10:45:52.345916', 'skjuhdhduh', 980190963) RETURNING "id"