app/controllers/surveys_controller.rb

SELECT * FROM "surveys" WHERE ("surveys"."user_id" = 1)
SELECT * FROM "surveys" WHERE ("surveys"."id" = 1)
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def index

    if current_user && !current_user.isadmin?
      @surveys = Survey.find_user_surveys(current_user.id)
    elsif current_user && current_user.isadmin?
      @surveys = Survey.find(:all)

SELECT * FROM "surveys" WHERE ("surveys"."id" = 1)
---
  def show
    if !(current_user.isadmin?)
      @survey = Survey.find(:all,  :conditions => {:status => true, :id => params[:id]})

SELECT * FROM "surveys" WHERE ("surveys"."id" = 1)
---
  def edit
    @survey = Survey.find(params[:id])

INSERT INTO "surveys" ("created_at", "title", "updated_at", "survey_category", "user_id", "description", "status") VALUES('2010-08-01 10:44:18.482299', 'dd', '2010-08-01 10:44:18.482299', 'ddd', 1, 'dd', 't') RETURNING "id"
---
  def create
    @survey = Survey.new(params[:survey])

    respond_to do |format|
      if @survey.save

SELECT * FROM "surveys" WHERE ("surveys"."id" = 1)
---
  def update
    @survey = Survey.find(params[:id])

SELECT * FROM "surveys" WHERE ("surveys"."id" = 1)
---
  def destroy
    @survey = Survey.find(params[:id])